La-guajolota/PSOC-5lp/Final_MELCHOR/Control_contador_d_ciclos.cydsn/codegentemp/btns.h
/*******************************************************************************
* File Name: btns.h  
* Version 1.90
*
* Description:
*  This file containts Status Register function prototypes and register defines
*
* Note:
*
********************************************************************************
* Copyright 2008-2015, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
*******************************************************************************/

#if !defined(CY_STATUS_REG_btns_H) /* CY_STATUS_REG_btns_H */
#define CY_STATUS_REG_btns_H

#include "cyfitter.h"

#if ((CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC3) || \
     (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC4) || \
     (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC5))
    #include "cytypes.h"
    #include "CyLib.h"
#else
    #include "syslib/cy_syslib.h"
#endif

    
/***************************************
*     Data Struct Definitions
***************************************/

/* Sleep Mode API Support */
typedef struct
{
    uint8 statusState;

} btns_BACKUP_STRUCT;


/***************************************
*        Function Prototypes
***************************************/

uint8 btns_Read(void) ;
void btns_InterruptEnable(void) ;
void btns_InterruptDisable(void) ;
void btns_WriteMask(uint8 mask) ;
uint8 btns_ReadMask(void) ;


/***************************************
*           API Constants
***************************************/

#define btns_STATUS_INTR_ENBL    0x10u


/***************************************
*         Parameter Constants
***************************************/

/* Status Register Inputs */
#define btns_INPUTS              3


/***************************************
*             Registers
***************************************/

/* Status Register */
#define btns_Status             (* (reg8 *) btns_sts_intr_sts_reg__STATUS_REG )
#define btns_Status_PTR         (  (reg8 *) btns_sts_intr_sts_reg__STATUS_REG )
#define btns_Status_Mask        (* (reg8 *) btns_sts_intr_sts_reg__MASK_REG )
#define btns_Status_Aux_Ctrl    (* (reg8 *) btns_sts_intr_sts_reg__STATUS_AUX_CTL_REG )

#endif /* End CY_STATUS_REG_btns_H */


/* [] END OF FILE */
